st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Provider_CLI_RTOS/Src/usbpd_dpm.c
#ifdef USBPD_CLI
#ifndef HAL_UART_MODULE_ENABLED
#error "To enable the CLI you need the HAL_UART_MODULE_ENABLED"
#endif
  /* CLI enabling */
  CLI_Init(BSP_USART_GetHandle());
  CLI_Run();
#endif /* USBPD_CLI */

  /* PWR SET UP */
  USBPD_PWR_IF_Init();
  USBPD_PWR_IF_PowerResetGlobal();
  
  /* PE SET UP : Port 0 */
  USBPD_PE_Init(USBPD_PORT_0, DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole, dpmCallbacks);

  /* CAD SET UP : Port 0 */
  USBPD_CAD_Init(USBPD_PORT_0, CAD_cbs);

  /* Enable CAD on Port 0 */
  USBPD_CAD_PortEnable(USBPD_PORT_0, USBPD_CAD_ENABLE);
  
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 2);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  PETaskHandle = NULL;
  
  return USBPD_OK;
}

/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  uint8_t PortNum = argument ? *(uint8_t *)argument : USBPD_PORT_0;
  assert_param(USBPD_PORT_IsValid(PortNum));
  
  for(;;)
  {
    USBPD_PE_SRCProcess(PortNum);
    osDelay(2);
  }
}


/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(CAD_Task_delay);
  }
}


#ifdef USBPD_CLI
static char buffer[CLI_OUTPUT_MAX_SIZE];
#endif
/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  assert_param(USBPD_PORT_IsValid(PortNum));
  
    switch(State)
    {
    case USBPD_CAD_STATE_ATTACHED:
    case USBPD_CAD_STATE_ATTEMC:
    /* An sink is attached on the port */
      osDelay(100);
      
      /* Enable VBUS */
      USBPD_DPM_TurnOnPower(PortNum, PE_GetPowerRole(PortNum));
      
      /* Enable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, Cc);
      
      DPM_Ports[PortNum].DPM_IsConnected = 1;
      
      /* Led feedback */
#ifdef USBPD_LED_SERVER
      Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */
      osDelay(150);
      
      USBPD_PE_IsCableConnected(PortNum, 1);
      /* Create PE task */
      if (PETaskHandle == NULL)
      {
        osThreadDef(PETask, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 2);
      PETaskHandle = osThreadCreate(osThread(PETask), &PortNum);
      }
#ifdef USBPD_CLI
      sprintf(buffer, "\r\n*** Attached: Port %d CC%d\r\n>", PortNum, Cc);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
      break;
      
    case USBPD_CAD_STATE_EMC:
      /* If this is coming from a previous connection*/
      if (DPM_Ports[PortNum].DPM_IsConnected)
      {
        /* Disable VBUS */
        USBPD_DPM_TurnOffPower(PortNum, PE_GetPowerRole(PortNum));
       
        /* Disable VCONN*/
        USBPD_PWR_IF_Enable_VConn(PortNum, CCNONE);

        osDelay(200);

        /* The ufp is detached */
        USBPD_PE_IsCableConnected(PortNum, 0);
        if (PETaskHandle != NULL)
        {
          osThreadTerminate(PETaskHandle);
          PETaskHandle = NULL;
        }
        DPM_Ports[PortNum].DPM_IsConnected = 0;
      }
      
      /* Led feedback */
#ifdef USBPD_LED_SERVER
      Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
#endif /* USBPD_LED_SERVER */
      
#ifdef USBPD_CLI
      sprintf(buffer, "\r\n*** Attached EMC: Port %d CC%d\r\n>", PortNum, Cc);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */

      break;
      
    case USBPD_CAD_STATE_DETACHED:
      /* Disable VBUS */
      USBPD_DPM_TurnOffPower(PortNum,PE_GetPowerRole(PortNum));
      
      /* Disable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, CCNONE);
      
    /* a delay to be sure of the turn power off */
      osDelay(100);
    /* The sink is detached */
      USBPD_PE_IsCableConnected(PortNum, 0);
    
    /* PE Task termination */
      if (PETaskHandle != NULL)
      {
        osThreadTerminate(PETaskHandle);
        PETaskHandle = NULL;
      }
      DPM_Ports[PortNum].DPM_IsConnected = 0;
      
      /* Led feedback */
#ifdef USBPD_LED_SERVER      
      Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
      Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */

#ifdef USBPD_CLI
      sprintf(buffer, "\r\n*** Detached: Port %d\r\n>", PortNum);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
      break;
      
    case USBPD_CAD_STATE_ACCESSORY:
#ifdef USBPD_CLI
      sprintf(buffer, "\r\n*** Attached accessory: Port %d not supported\r\n>", PortNum);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */      
      break;
      
    case USBPD_CAD_STATE_DEBUG:
#ifdef USBPD_CLI
      sprintf(buffer, "\r\n*** Attached debug: Port %d not supported\r\n>", PortNum);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
      break;

    default:
      break;
    }
  }

/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @param  CurrentRole the current role
  * @param  Status status on hard reset event
  * @retval 0 if ok, 1 if error, 2 if busy
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
  uint32_t ret = 1;
  switch (Status)
  {
  case USBPD_HR_STATUS_START_ACK:
  case USBPD_HR_STATUS_START_REQ:
    if (USBPD_PORTPOWERROLE_SRC == CurrentRole)
  {
    /* Reset the power supply */
    USBPD_DPM_TurnOffPower(PortNum,PE_GetPowerRole(PortNum));
      ret = 1;
  }
  else
  {
      ret = (uint32_t)USBPD_PWR_IF_IsEnabled(PortNum);
  }
    break;
  case USBPD_HR_STATUS_COMPLETED:
    if (USBPD_PORTPOWERROLE_SRC == CurrentRole)
    {
          /* Reset the power supply */
      USBPD_DPM_TurnOnPower(PortNum,CurrentRole);
      ret = 1;
    }
    break;
  default:
      break;
  }
 return ret;
}

/**
  * @brief  Turn Off power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  /* Reset the power supply */
  USBPD_PWR_IF_PowerReset(PortNum);

  osDelay(30); /* wait until discharge vbus */

#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Turn On power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  /* Enable the output */
  USBPD_PWR_IF_Enable(PortNum, ENABLE, Role);
  osDelay(30);
  /* Led feedback */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

